# d = {"北京大学":"北京", "中国人民大学":"北京","清华大学":"北京",\
# "北京航空航天大学":"北京","北京理工大学":"北京","中国农业大学":"北京",\
# "北京师范大学":"北京","中央民族大学":"北京","南开大学":"天津",\
# "天津大学":"天津","大连理工大学":"辽宁","吉林大学":"吉林",\
# "哈尔滨工业大学":"黑龙江","复旦大学":"上海", "同济大学":"上海",\
# "上海交通大学":"上海","华东师范大学":"上海", "南京大学":"江苏",\
# "东南大学":"江苏","浙江大学":"浙江","中国科学技术大学":"安徽",\
# "厦门大学":"福建","山东大学":"山东", "中国海洋大学":"山东",\
# "武汉大学":"湖北","华中科技大学":"湖北", "中南大学":"湖南",\
# "中山大学":"广东","华南理工大学":"广东", "四川大学":"四川",\
# "电子科技大学":"四川","重庆大学":"重庆","西安交通大学":"陕西",\
# "西北工业大学":"陕西","兰州大学":"甘肃", "国防科技大学":"湖南",\
# "东北大学":"辽宁","郑州大学":"河南", "湖南大学":"湖南", "云南大学":"云南", \
# "西北农林科技大学":"陕西", "新疆大学":"新疆"}
# a = list(d.values())
# b ={}
# for i in a:
#     b[i] = b.get(i,0) + 1
# for k,v in b.items():
#     print("{}:{}".format(k,v))

# ls = ["综合", "理工", "综合", "综合", "综合", "综合", "综合", "综合", \
#     "综合", "综合", "师范", "理工", "综合", "理工", "综合", "综合", \
#     "综合", "综合", "综合", "理工", "理工", "理工", "理工", "师范", \
#     "综合", "农林", "理工", "综合", "理工", "理工", "理工", "综合", \
#     "理工", "综合", "综合", "理工", "农林", "民族", "军事"]
# b = {}
# for i in ls:
#     b[i] = b.get(i,0)+1
# for k,v in b.items():
#     print("{}:{}".format(k,v))

# a = [11,22,33,44,55,66,77,88,99]
# b = [33,66,99,22,55,88,11,44,77]
# s = 0
# for i in range(len(a)):
#     s += a[i]*b[i]
# print(s)

""""计算a中各元素与b逐项乘积的累加和。"""
# a = [[11,22,33], [44,55,66], [77,88,99]]
# b = [33,66,99]
# s = 0
# for c in a:
#     for j in range(len(b)):
#         s += c[j]*b[j]
# print(s)

# d ={"中文":101,"英文":202,"法文":203,"德文":204,"韩文":206}
# d["日文"] = 205
# d["中文"] = 201
# del d["韩文"]
# for k,v in d.items():
#     print("{}:{}".format(k,v))

# ls = [1080,750,1080,750,1080,850,960,2000,1250,1630,1080,\
# 1800,1080,2100,1080,1450,2500,560,1080,560]
# counts ={}
# for num in ls:
#              counts[num] =counts.get(num,0) +1
# items = list(counts.items())
# items.sort(key = lambda x:[1],reverse = True)
# num,count = items[0]
# print("众数为{},出现频率为{}。".format(num,count))

ls = [23,41,32,12,56,76,35,67,89,44]
print(ls)
def bub_sort(s_list):
    for i in range(len(s_list)-1):
        ......                #此段代码请完善
    return s_list
bub_sort(ls)
print(ls)